{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Convolution2D", "config": {"name": "block1_conv1", "trainable": false, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "config": {"name": "block1_conv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_conv1_act", "class_name": "Activation", "config": {"name": "block1_conv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0]]]}, {"name": "block1_conv2", "class_name": "Convolution2D", "config": {"name": "block1_conv2", "trainable": false, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block1_conv1_act", 0, 0]]]}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "config": {"name": "block1_conv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block1_conv2_act", "class_name": "Activation", "config": {"name": "block1_conv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0]]]}, {"name": "block2_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block2_sepconv1", "trainable": false, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block1_conv2_act", 0, 0]]]}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block2_sepconv1", 0, 0]]]}, {"name": "block2_sepconv2_act", "class_name": "Activation", "config": {"name": "block2_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0]]]}, {"name": "block2_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block2_sepconv2", "trainable": false, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0]]]}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block2_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block2_sepconv2", 0, 0]]]}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": false, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block1_conv2_act", 0, 0]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block2_pool", 0, 0], ["batchnormalization_1", 0, 0]]]}, {"name": "block3_sepconv1_act", "class_name": "Activation", "config": {"name": "block3_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "block3_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block3_sepconv1", "trainable": false, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0]]]}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block3_sepconv1", 0, 0]]]}, {"name": "block3_sepconv2_act", "class_name": "Activation", "config": {"name": "block3_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0]]]}, {"name": "block3_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block3_sepconv2", "trainable": false, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0]]]}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block3_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block3_sepconv2", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": false, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block3_pool", 0, 0], ["batchnormalization_2", 0, 0]]]}, {"name": "block4_sepconv1_act", "class_name": "Activation", "config": {"name": "block4_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "block4_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block4_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block4_sepconv1_act", 0, 0]]]}, {"name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block4_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block4_sepconv1", 0, 0]]]}, {"name": "block4_sepconv2_act", "class_name": "Activation", "config": {"name": "block4_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block4_sepconv1_bn", 0, 0]]]}, {"name": "block4_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block4_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block4_sepconv2_act", 0, 0]]]}, {"name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block4_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block4_sepconv2", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": false, "nb_filter": 728, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["block4_sepconv2_bn", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block4_pool", 0, 0], ["batchnormalization_3", 0, 0]]]}, {"name": "block5_sepconv1_act", "class_name": "Activation", "config": {"name": "block5_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "block5_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block5_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block5_sepconv1_act", 0, 0]]]}, {"name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block5_sepconv1", 0, 0]]]}, {"name": "block5_sepconv2_act", "class_name": "Activation", "config": {"name": "block5_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block5_sepconv1_bn", 0, 0]]]}, {"name": "block5_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block5_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block5_sepconv2_act", 0, 0]]]}, {"name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block5_sepconv2", 0, 0]]]}, {"name": "block5_sepconv3_act", "class_name": "Activation", "config": {"name": "block5_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block5_sepconv2_bn", 0, 0]]]}, {"name": "block5_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block5_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block5_sepconv3_act", 0, 0]]]}, {"name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block5_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block5_sepconv3", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block5_sepconv3_bn", 0, 0], ["merge_3", 0, 0]]]}, {"name": "block6_sepconv1_act", "class_name": "Activation", "config": {"name": "block6_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "block6_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block6_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block6_sepconv1_act", 0, 0]]]}, {"name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block6_sepconv1", 0, 0]]]}, {"name": "block6_sepconv2_act", "class_name": "Activation", "config": {"name": "block6_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block6_sepconv1_bn", 0, 0]]]}, {"name": "block6_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block6_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block6_sepconv2_act", 0, 0]]]}, {"name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block6_sepconv2", 0, 0]]]}, {"name": "block6_sepconv3_act", "class_name": "Activation", "config": {"name": "block6_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block6_sepconv2_bn", 0, 0]]]}, {"name": "block6_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block6_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block6_sepconv3_act", 0, 0]]]}, {"name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block6_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block6_sepconv3", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block6_sepconv3_bn", 0, 0], ["merge_4", 0, 0]]]}, {"name": "block7_sepconv1_act", "class_name": "Activation", "config": {"name": "block7_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "block7_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block7_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block7_sepconv1_act", 0, 0]]]}, {"name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block7_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block7_sepconv1", 0, 0]]]}, {"name": "block7_sepconv2_act", "class_name": "Activation", "config": {"name": "block7_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block7_sepconv1_bn", 0, 0]]]}, {"name": "block7_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block7_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block7_sepconv2_act", 0, 0]]]}, {"name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block7_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block7_sepconv2", 0, 0]]]}, {"name": "block7_sepconv3_act", "class_name": "Activation", "config": {"name": "block7_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block7_sepconv2_bn", 0, 0]]]}, {"name": "block7_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block7_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block7_sepconv3_act", 0, 0]]]}, {"name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block7_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block7_sepconv3", 0, 0]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block7_sepconv3_bn", 0, 0], ["merge_5", 0, 0]]]}, {"name": "block8_sepconv1_act", "class_name": "Activation", "config": {"name": "block8_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"name": "block8_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block8_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block8_sepconv1_act", 0, 0]]]}, {"name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block8_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block8_sepconv1", 0, 0]]]}, {"name": "block8_sepconv2_act", "class_name": "Activation", "config": {"name": "block8_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block8_sepconv1_bn", 0, 0]]]}, {"name": "block8_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block8_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block8_sepconv2_act", 0, 0]]]}, {"name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block8_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block8_sepconv2", 0, 0]]]}, {"name": "block8_sepconv3_act", "class_name": "Activation", "config": {"name": "block8_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block8_sepconv2_bn", 0, 0]]]}, {"name": "block8_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block8_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block8_sepconv3_act", 0, 0]]]}, {"name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block8_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block8_sepconv3", 0, 0]]]}, {"name": "merge_7", "class_name": "Merge", "config": {"name": "merge_7", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block8_sepconv3_bn", 0, 0], ["merge_6", 0, 0]]]}, {"name": "block9_sepconv1_act", "class_name": "Activation", "config": {"name": "block9_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"name": "block9_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block9_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block9_sepconv1_act", 0, 0]]]}, {"name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block9_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block9_sepconv1", 0, 0]]]}, {"name": "block9_sepconv2_act", "class_name": "Activation", "config": {"name": "block9_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block9_sepconv1_bn", 0, 0]]]}, {"name": "block9_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block9_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block9_sepconv2_act", 0, 0]]]}, {"name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block9_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block9_sepconv2", 0, 0]]]}, {"name": "block9_sepconv3_act", "class_name": "Activation", "config": {"name": "block9_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block9_sepconv2_bn", 0, 0]]]}, {"name": "block9_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block9_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block9_sepconv3_act", 0, 0]]]}, {"name": "block9_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block9_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block9_sepconv3", 0, 0]]]}, {"name": "merge_8", "class_name": "Merge", "config": {"name": "merge_8", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block9_sepconv3_bn", 0, 0], ["merge_7", 0, 0]]]}, {"name": "block10_sepconv1_act", "class_name": "Activation", "config": {"name": "block10_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"name": "block10_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block10_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block10_sepconv1_act", 0, 0]]]}, {"name": "block10_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block10_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block10_sepconv1", 0, 0]]]}, {"name": "block10_sepconv2_act", "class_name": "Activation", "config": {"name": "block10_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block10_sepconv1_bn", 0, 0]]]}, {"name": "block10_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block10_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block10_sepconv2_act", 0, 0]]]}, {"name": "block10_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block10_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block10_sepconv2", 0, 0]]]}, {"name": "block10_sepconv3_act", "class_name": "Activation", "config": {"name": "block10_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block10_sepconv2_bn", 0, 0]]]}, {"name": "block10_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block10_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block10_sepconv3_act", 0, 0]]]}, {"name": "block10_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block10_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block10_sepconv3", 0, 0]]]}, {"name": "merge_9", "class_name": "Merge", "config": {"name": "merge_9", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block10_sepconv3_bn", 0, 0], ["merge_8", 0, 0]]]}, {"name": "block11_sepconv1_act", "class_name": "Activation", "config": {"name": "block11_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_9", 0, 0]]]}, {"name": "block11_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block11_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block11_sepconv1_act", 0, 0]]]}, {"name": "block11_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block11_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block11_sepconv1", 0, 0]]]}, {"name": "block11_sepconv2_act", "class_name": "Activation", "config": {"name": "block11_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block11_sepconv1_bn", 0, 0]]]}, {"name": "block11_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block11_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block11_sepconv2_act", 0, 0]]]}, {"name": "block11_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block11_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block11_sepconv2", 0, 0]]]}, {"name": "block11_sepconv3_act", "class_name": "Activation", "config": {"name": "block11_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block11_sepconv2_bn", 0, 0]]]}, {"name": "block11_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block11_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block11_sepconv3_act", 0, 0]]]}, {"name": "block11_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block11_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block11_sepconv3", 0, 0]]]}, {"name": "merge_10", "class_name": "Merge", "config": {"name": "merge_10", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block11_sepconv3_bn", 0, 0], ["merge_9", 0, 0]]]}, {"name": "block12_sepconv1_act", "class_name": "Activation", "config": {"name": "block12_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_10", 0, 0]]]}, {"name": "block12_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block12_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block12_sepconv1_act", 0, 0]]]}, {"name": "block12_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block12_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block12_sepconv1", 0, 0]]]}, {"name": "block12_sepconv2_act", "class_name": "Activation", "config": {"name": "block12_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block12_sepconv1_bn", 0, 0]]]}, {"name": "block12_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block12_sepconv2", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block12_sepconv2_act", 0, 0]]]}, {"name": "block12_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block12_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block12_sepconv2", 0, 0]]]}, {"name": "block12_sepconv3_act", "class_name": "Activation", "config": {"name": "block12_sepconv3_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block12_sepconv2_bn", 0, 0]]]}, {"name": "block12_sepconv3", "class_name": "SeparableConvolution2D", "config": {"name": "block12_sepconv3", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block12_sepconv3_act", 0, 0]]]}, {"name": "block12_sepconv3_bn", "class_name": "BatchNormalization", "config": {"name": "block12_sepconv3_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block12_sepconv3", 0, 0]]]}, {"name": "merge_11", "class_name": "Merge", "config": {"name": "merge_11", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block12_sepconv3_bn", 0, 0], ["merge_10", 0, 0]]]}, {"name": "block13_sepconv1_act", "class_name": "Activation", "config": {"name": "block13_sepconv1_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["merge_11", 0, 0]]]}, {"name": "block13_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block13_sepconv1", "trainable": false, "nb_filter": 728, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block13_sepconv1_act", 0, 0]]]}, {"name": "block13_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block13_sepconv1_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block13_sepconv1", 0, 0]]]}, {"name": "block13_sepconv2_act", "class_name": "Activation", "config": {"name": "block13_sepconv2_act", "trainable": false, "activation": "relu"}, "inbound_nodes": [[["block13_sepconv1_bn", 0, 0]]]}, {"name": "block13_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block13_sepconv2", "trainable": false, "nb_filter": 1024, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block13_sepconv2_act", 0, 0]]]}, {"name": "block13_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block13_sepconv2_bn", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block13_sepconv2", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": false, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["merge_11", 0, 0]]]}, {"name": "block13_pool", "class_name": "MaxPooling2D", "config": {"name": "block13_pool", "trainable": false, "pool_size": [3, 3], "border_mode": "same", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["block13_sepconv2_bn", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "trainable": false, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "merge_12", "class_name": "Merge", "config": {"name": "merge_12", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["block13_pool", 0, 0], ["batchnormalization_4", 0, 0]]]}, {"name": "block14_sepconv1", "class_name": "SeparableConvolution2D", "config": {"name": "block14_sepconv1", "trainable": true, "nb_filter": 1536, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["merge_12", 0, 0]]]}, {"name": "block14_sepconv1_bn", "class_name": "BatchNormalization", "config": {"name": "block14_sepconv1_bn", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block14_sepconv1", 0, 0]]]}, {"name": "block14_sepconv1_act", "class_name": "Activation", "config": {"name": "block14_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block14_sepconv1_bn", 0, 0]]]}, {"name": "block14_sepconv2", "class_name": "SeparableConvolution2D", "config": {"name": "block14_sepconv2", "trainable": true, "nb_filter": 2048, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "depth_multiplier": 1, "dim_ordering": "tf", "depthwise_regularizer": null, "pointwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null, "b_constraint": null, "bias": false}, "inbound_nodes": [[["block14_sepconv1_act", 0, 0]]]}, {"name": "block14_sepconv2_bn", "class_name": "BatchNormalization", "config": {"name": "block14_sepconv2_bn", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["block14_sepconv2", 0, 0]]]}, {"name": "block14_sepconv2_act", "class_name": "Activation", "config": {"name": "block14_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block14_sepconv2_bn", 0, 0]]]}, {"name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "globalaveragepooling2d_1", "trainable": true, "dim_ordering": "tf"}, "inbound_nodes": [[["block14_sepconv2_act", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 2, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}, "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "1.2.2"}